zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/component/gmac.h
/* -------- GMAC_MAN : (GMAC Offset: 0x34) (R/W 32) PHY Maintenance Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DATA:16;                   /**< bit:  0..15  PHY Data                                 */
    uint32_t WTN:2;                     /**< bit: 16..17  Write Ten                                */
    uint32_t REGA:5;                    /**< bit: 18..22  Register Address                         */
    uint32_t PHYA:5;                    /**< bit: 23..27  PHY Address                              */
    uint32_t OP:2;                      /**< bit: 28..29  Operation                                */
    uint32_t CLTTO:1;                   /**< bit:     30  Clause 22 Operation                      */
    uint32_t WZO:1;                     /**< bit:     31  Write ZERO                               */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} GMAC_MAN_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GMAC_MAN_OFFSET                     (0x34)                                        /**<  (GMAC_MAN) PHY Maintenance Register  Offset */

#define GMAC_MAN_DATA_Pos                   0                                              /**< (GMAC_MAN) PHY Data Position */
#define GMAC_MAN_DATA_Msk                   (_U_(0xFFFF) << GMAC_MAN_DATA_Pos)             /**< (GMAC_MAN) PHY Data Mask */
#define GMAC_MAN_DATA(value)                (GMAC_MAN_DATA_Msk & ((value) << GMAC_MAN_DATA_Pos))
#define GMAC_MAN_WTN_Pos                    16                                             /**< (GMAC_MAN) Write Ten Position */
#define GMAC_MAN_WTN_Msk                    (_U_(0x3) << GMAC_MAN_WTN_Pos)                 /**< (GMAC_MAN) Write Ten Mask */
#define GMAC_MAN_WTN(value)                 (GMAC_MAN_WTN_Msk & ((value) << GMAC_MAN_WTN_Pos))
#define GMAC_MAN_REGA_Pos                   18                                             /**< (GMAC_MAN) Register Address Position */
#define GMAC_MAN_REGA_Msk                   (_U_(0x1F) << GMAC_MAN_REGA_Pos)               /**< (GMAC_MAN) Register Address Mask */
#define GMAC_MAN_REGA(value)                (GMAC_MAN_REGA_Msk & ((value) << GMAC_MAN_REGA_Pos))
#define GMAC_MAN_PHYA_Pos                   23                                             /**< (GMAC_MAN) PHY Address Position */
#define GMAC_MAN_PHYA_Msk                   (_U_(0x1F) << GMAC_MAN_PHYA_Pos)               /**< (GMAC_MAN) PHY Address Mask */
#define GMAC_MAN_PHYA(value)                (GMAC_MAN_PHYA_Msk & ((value) << GMAC_MAN_PHYA_Pos))
#define GMAC_MAN_OP_Pos                     28                                             /**< (GMAC_MAN) Operation Position */
#define GMAC_MAN_OP_Msk                     (_U_(0x3) << GMAC_MAN_OP_Pos)                  /**< (GMAC_MAN) Operation Mask */
#define GMAC_MAN_OP(value)                  (GMAC_MAN_OP_Msk & ((value) << GMAC_MAN_OP_Pos))
#define GMAC_MAN_CLTTO_Pos                  30                                             /**< (GMAC_MAN) Clause 22 Operation Position */
#define GMAC_MAN_CLTTO_Msk                  (_U_(0x1) << GMAC_MAN_CLTTO_Pos)               /**< (GMAC_MAN) Clause 22 Operation Mask */
#define GMAC_MAN_CLTTO                      GMAC_MAN_CLTTO_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_MAN_CLTTO_Msk instead */
#define GMAC_MAN_WZO_Pos                    31                                             /**< (GMAC_MAN) Write ZERO Position */
#define GMAC_MAN_WZO_Msk                    (_U_(0x1) << GMAC_MAN_WZO_Pos)                 /**< (GMAC_MAN) Write ZERO Mask */
#define GMAC_MAN_WZO                        GMAC_MAN_WZO_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_MAN_WZO_Msk instead */
#define GMAC_MAN_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (GMAC_MAN) Register MASK  (Use GMAC_MAN_Msk instead)  */
#define GMAC_MAN_Msk                        _U_(0xFFFFFFFF)                                /**< (GMAC_MAN) Register Mask  */


/* -------- GMAC_RPQ : (GMAC Offset: 0x38) (R/ 32) Received Pause Quantum Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RPQ:16;                    /**< bit:  0..15  Received Pause Quantum                   */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} GMAC_RPQ_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GMAC_RPQ_OFFSET                     (0x38)                                        /**<  (GMAC_RPQ) Received Pause Quantum Register  Offset */

#define GMAC_RPQ_RPQ_Pos                    0                                              /**< (GMAC_RPQ) Received Pause Quantum Position */
#define GMAC_RPQ_RPQ_Msk                    (_U_(0xFFFF) << GMAC_RPQ_RPQ_Pos)              /**< (GMAC_RPQ) Received Pause Quantum Mask */
#define GMAC_RPQ_RPQ(value)                 (GMAC_RPQ_RPQ_Msk & ((value) << GMAC_RPQ_RPQ_Pos))
#define GMAC_RPQ_MASK                       _U_(0xFFFF)                                    /**< \deprecated (GMAC_RPQ) Register MASK  (Use GMAC_RPQ_Msk instead)  */
#define GMAC_RPQ_Msk                        _U_(0xFFFF)                                    /**< (GMAC_RPQ) Register Mask  */


/* -------- GMAC_TPQ : (GMAC Offset: 0x3c) (R/W 32) Transmit Pause Quantum Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TPQ:16;                    /**< bit:  0..15  Transmit Pause Quantum                   */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} GMAC_TPQ_Type;
